desafio11-12-13/ReporteResultadosArtilleryProcess/artilleryInfoLog.txt
Phase started: unnamed (index: 0, duration: 1s) 12:41:09(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 12:41:10(-0300)

--------------------------------------
Metrics for period to: 12:41:10(-0300) (width: 0.302s)
--------------------------------------

http.codes.200: ................................................................ 17
http.request_rate: ............................................................. 19/sec
http.requests: ................................................................. 19
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 188
  median: ...................................................................... 2
  p95: ......................................................................... 36.2
  p99: ......................................................................... 36.2
http.responses: ................................................................ 17
vusers.created: ................................................................ 16
vusers.created_by_name.0: ...................................................... 16


--------------------------------------
Metrics for period to: 12:41:20(-0300) (width: 9.989s)
--------------------------------------

http.codes.200: ................................................................ 575
http.request_rate: ............................................................. 58/sec
http.requests: ................................................................. 581
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 1900
  median: ...................................................................... 284.3
  p95: ......................................................................... 871.5
  p99: ......................................................................... 907
http.responses: ................................................................ 575
vusers.created: ................................................................ 34
vusers.created_by_name.0: ...................................................... 34


--------------------------------------
Metrics for period to: 12:41:30(-0300) (width: 7.425s)
--------------------------------------

http.codes.200: ................................................................ 408
http.request_rate: ............................................................. 55/sec
http.requests: ................................................................. 400
http.response_time:
  min: ......................................................................... 41
  max: ......................................................................... 1922
  median: ...................................................................... 87.4
  p95: ......................................................................... 907
  p99: ......................................................................... 1107.9
http.responses: ................................................................ 408
vusers.completed: .............................................................. 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 16124.7
  max: ......................................................................... 18056.8
  median: ...................................................................... 17158.9
  p95: ......................................................................... 17859.2
  p99: ......................................................................... 17859.2


All VUs finished. Total time: 19 seconds

--------------------------------
Summary report @ 12:41:29(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 44/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 1922
  median: ...................................................................... 130.3
  p95: ......................................................................... 889.1
  p99: ......................................................................... 1085.9
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 16124.7
  max: ......................................................................... 18056.8
  median: ...................................................................... 17158.9
  p95: ......................................................................... 17859.2
  p99: ......................................................................... 17859.2